{
  "photos": [
    {
      "added": "2021-12-05",
      "image": "2021-12-05.jpg",
      "date": "1948",
      "description": "A Dec. 4, 1948 photo of Santa being greeted by a large crowd as he made a visit to Bitler’s Car & Home Supply that was located at 470 Main Street near the corner of Lindsey Street."
    },
    {
      "added": "2021-11-28",
      "image": "2021-11-28.jpg",
      "date": "1875",
      "description": "A c.1875 view of North Main Street from the intersection with Main Street. The brick building barely visible on the left is the Rankin Block. The small building to the right of the Rankin Block is a barbershop. Further up North Main Street on the left is the two-story brick house built by David Gay. This is where the Free Press is located today. A wagon loaded with barrels probably from Blackington’s Corner or beyond can be seen in the middle of North Main Street on its way to a lime kiln along the shore."
    },
    {
      "added": "2021-11-21",
      "image": "2021-11-21.jpg",
      "date": "1956",
      "description": "A September 10, 1956 photo of Kennedy Crane Jr. standing in front of the Senter-Crane's Department Store that was located in the Pillsbury Block at 386 Main Street from 1926-1994."
    },
    {
      "added": "2021-11-11",
      "image": "2021-11-11.jpg",
      "date": "1963",
      "description": "A c.1963 interior photo of Al's Hairdressing Salon that was located on Main Street near the corner of Park Street. Chapman Park is located there today. Employee Fay Molloy can be seen in the front having her hair done by fellow beautician Sally Nord. Photo courtesy of Tom Molloy."
    },
    {
      "added": "2021-11-07",
      "image": "2021-11-07.jpg",
      "date": "1952",
      "description": "A February 1952 photo of the ice-up fishing vessel Storm. The Storm was built at Bath Iron Works in 1936 and belonged to the General Seafoods and 40 Fathom fishing fleets. She was acquired by the U.S. Navy in 1942 and served during World War II as the USS YP-423 until 1945 and then was sold for commercial service. The Storm was abandoned in Cundys Harbor around 1980 and scrapped in 1991."
    },
    {
      "added": "2021-10-31",
      "image": "2021-10-31.jpg",
      "date": "1951",
      "description": "A July 19, 1951 photo of flooding on Union Street after heavy rains."
    },
    {
      "added": "2021-10-24",
      "image": "2021-10-24.jpg",
      "date": "1890",
      "description": "A c.1890 photo of the Bay Point Hotel. W. H. Glover & Co. commenced work on the hotel in 1888. A formal opening was held on July 10, 1889 which included a 16-piece orchestra and a grand ball. In 1901 the Bay Point Hotel was purchased by the Ricker family of Poland Spring. After the purchase the name for the planned new hotel was briefly the Hotel Breakwater but was changed to Samoset. The name Nahanada was another suggestion for the new hotel. After extensive renovations and remodeling the Samoset opened on June 25, 1902 and the first guest to register was George R. Daniels, general passenger agent of the New York Central Railroad. The old Samoset burned down in 1972."
    },
    {
      "added": "2021-10-17",
      "image": "2021-10-17.png",
      "date": "1918",
      "description": "An October 4, 1918 headline from the Courier-Gazette concerning the Spanish influenza pandemic. That same month the Narragansett Hotel at the corner of Park and Union Street was used as an emergency hospital devoted to influenza patients. On top of this the United States was still involved in World War I and Rockland was recovering from a measles outbreak that hit the area hard in 1917."
    },
    {
      "added": "2021-10-11",
      "image": "2021-10-11.jpg",
      "date": "1917",
      "description": "A 1917 photo of Warren Street."
    },
    {
      "added": "2021-09-19",
      "image": "2021-09-19.jpg",
      "date": "1905",
      "description": "A c.1905 postcard view of Beech Street from Union Street. The library can be seen on the left."
    },
    {
      "added": "2021-09-12",
      "image": "2021-09-12.jpg",
      "date": "1958",
      "description": "An April 28, 1958 aerial view of the Mechanic Street, Pacific Street and South Street neighborhood in the South End of Rockland."
    },
    {
      "added": "2021-09-05",
      "image": "2021-09-05.jpg",
      "date": "1984",
      "description": "An August 1984 photo of Jordan’s Market that was located in the Crockett Building at 745 Main Street for many years. This block was built in 1854 and was originally four stories tall. In 1951 the top two floors were removed and the decorative stone that included the date 1854 were made part of the Fisherman’s Memorial Pier at the Public Landing. The Crockett Building was destroyed by fire in 1994. Claws is located there today."
    }
  ]
}
